In [593]:
import pandas as pd
import numpy as np

# Scoring Rubrics
## Essay – 1
    Scoring:	Score1, Score2, Resolved Score
    Rubric range:	1-6
    Resolved score range:	2-12

## Essay – 2

    Domain 1 (Writing Applications) Rubric range:	1-6
    Domain 2 (Language Conventions) Rubric range:	1-4
    Domain 1 (Writing Applications) Final score range:	1-6
    Domain 2 (Language Conventions) Final score range:	1-4

## Essay – 3
    Scoring:	1st Reader Score, 2nd Reader Score, Resolved CR Score
    Rubric range:	0-3
    Resolved CR score range:	0-3

## Essay-4
    Scoring:	1st Reader Score, 2nd Reader Score, Resolved CR Score
    Rubric range:	0-3
    Resolved CR score range:	0-3

## Essay-5
    Scoring:	Final, Score1, Score2 
    Final score range:	0-4
    Rubric range:	0-4

## Essay -6 
    Scoring:	Final, Score1, Score2 
    Final score range:	0-4
    Rubric range:	0-4

## Essay -7
    Scoring:	Rater_1, Rater_2, Resolved_Score
    Rubric range:	0-15
    Resolved score range:	0-30

## Essay-8
    Scoring:	Rater1Comp, Rater2Comp, Rater3Comp, Resolved Score
    Rater1Comp Rubric range:	0-30
    Rater2Comp Rubric range:	0-30
    Rater3Comp Rubric range:	0-60
    Resolved score range:	0-60

In [594]:
df = pd.read_excel('training_set_rel3.xlsx')

In [595]:
df.head()

,essay_id,essay_set,essay,rater1_domain1,rater2_domain1,rater3_domain1,domain1_score,rater1_domain2,rater2_domain2,domain2_score,...,rater2_trait3,rater2_trait4,rater2_trait5,rater2_trait6,rater3_trait1,rater3_trait2,rater3_trait3,rater3_trait4,rater3_trait5,rater3_trait6
0,1,1,"Dear local newspaper, I think effects computer...",4,4,NaN,8,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,1,"Dear @CAPS1 @CAPS2, I believe that using compu...",5,4,NaN,9,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,1,"Dear, @CAPS1 @CAPS2 @CAPS3 More and more peopl...",4,3,NaN,7,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,1,"Dear Local Newspaper, @CAPS1 I have found that...",5,5,NaN,10,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,1,"Dear @LOCATION1, I know having computers has a...",4,4,NaN,8,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [596]:
df.columns

Index(['essay_id', 'essay_set', 'essay', 'rater1_domain1', 'rater2_domain1',
       'rater3_domain1', 'domain1_score', 'rater1_domain2', 'rater2_domain2',
       'domain2_score', 'rater1_trait1', 'rater1_trait2', 'rater1_trait3',
       'rater1_trait4', 'rater1_trait5', 'rater1_trait6', 'rater2_trait1',
       'rater2_trait2', 'rater2_trait3', 'rater2_trait4', 'rater2_trait5',
       'rater2_trait6', 'rater3_trait1', 'rater3_trait2', 'rater3_trait3',
       'rater3_trait4', 'rater3_trait5', 'rater3_trait6'],
      dtype='object')

### dropping essay_id since it serves no need

In [597]:
df.drop(['essay_id'],axis=1,inplace = True)

In [598]:
df.head(2)

,essay_set,essay,rater1_domain1,rater2_domain1,rater3_domain1,domain1_score,rater1_domain2,rater2_domain2,domain2_score,rater1_trait1,...,rater2_trait3,rater2_trait4,rater2_trait5,rater2_trait6,rater3_trait1,rater3_trait2,rater3_trait3,rater3_trait4,rater3_trait5,rater3_trait6
0,1,"Dear local newspaper, I think effects computer...",4,4,NaN,8,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,"Dear @CAPS1 @CAPS2, I believe that using compu...",5,4,NaN,9,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### making different dataset for each essay set to get all the scores required

In [599]:
df_one = df[df['essay_set']==1]

In [600]:
df_one.shape

(1783, 27)

In [601]:
df_two = df[df['essay_set']==2].reset_index()
df_three = df[df['essay_set']==3].reset_index()
df_four = df[df['essay_set']==4].reset_index()
df_five = df[df['essay_set']==5].reset_index()
df_six = df[df['essay_set']==6].reset_index()
df_seven = df[df['essay_set']==7].reset_index()
df_eight = df[df['essay_set']==8].reset_index()

In [602]:
print(df_two.shape,
df_three.shape,
df_four.shape,  
df_five.shape, 
df_six.shape, 
df_seven.shape, 
df_eight.shape)

(1800, 28) (1726, 28) (1771, 28) (1805, 28) (1800, 28) (1569, 28) (723, 28)

In [603]:
df.isnull().sum()

essay_set             0
essay                 0
rater1_domain1        0
rater2_domain1        0
rater3_domain1    12849
domain1_score         0
rater1_domain2    11177
rater2_domain2    11177
domain2_score     11177
rater1_trait1     10685
rater1_trait2     10685
rater1_trait3     10685
rater1_trait4     10685
rater1_trait5     12254
rater1_trait6     12254
rater2_trait1     10685
rater2_trait2     10685
rater2_trait3     10685
rater2_trait4     10685
rater2_trait5     12254
rater2_trait6     12254
rater3_trait1     12849
rater3_trait2     12849
rater3_trait3     12849
rater3_trait4     12849
rater3_trait5     12849
rater3_trait6     12849
dtype: int64

### Here we can see domain_1 score = rater1_domain1+rater2_domain1 therefore we drop the columns

In [604]:
null_counts = df_one.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_one.drop(columns_with_nulls,axis=1,inplace = True)
df_one.drop(['rater1_domain1','rater2_domain1'],axis = 1,inplace = True)
df_one.head(3)

C:\Users\hs414\AppData\Local\Temp\ipykernel_3052\1690063876.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_one.drop(columns_with_nulls,axis=1,inplace = True)
C:\Users\hs414\AppData\Local\Temp\ipykernel_3052\1690063876.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_one.drop(['rater1_domain1','rater2_domain1'],axis = 1,inplace = True)

   essay_set                                              essay  domain1_score
0          1  Dear local newspaper, I think effects computer...              8
1          1  Dear @CAPS1 @CAPS2, I believe that using compu...              9
2          1  Dear, @CAPS1 @CAPS2 @CAPS3 More and more peopl...              7

### for essay_set = 2 we got scores on the basis of Writing Applications and Language Conventions therefor we added it to get the combined score also now the rubric range of the final score is 2-10

In [605]:
null_counts = df_two.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_two.drop(columns_with_nulls,axis=1,inplace = True)
df_two['domain1_score'] = df_two['domain1_score'].astype(int)+df_two['domain2_score'].astype(int)
df_two.drop(['rater1_domain1','rater2_domain1','rater1_domain2','rater2_domain2','domain2_score','index'],axis=1,inplace=True)
df_two.head(3)

   essay_set                                              essay  domain1_score
0          2  Certain materials being removed from libraries...              8
1          2  Write a persuasive essay to a newspaper reflec...              2
2          2  Do you think that libraries should remove cert...              5

In [606]:
df_three['rater1_domain1'] == df_three['rater2_domain1']

0        True
1        True
2        True
3        True
4        True
        ...
1721     True
1722     True
1723    False
1724     True
1725    False
Length: 1726, dtype: bool

###  for essay_set = 3 the combined score is max(rater_domain1,rater_domain2)

In [607]:
null_counts = df_three.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_three.drop(columns_with_nulls,axis=1,inplace = True)
df_three.head()
df_three.drop(['rater1_domain1','rater2_domain1','index'],axis = 1,inplace = True)
df_three.head(3)

   essay_set                                              essay  domain1_score
0          3  The features of the setting affect the cyclist...              1
1          3  The features of the setting affected the cycli...              2
2          3  Everyone travels to unfamiliar places. Sometim...              1

###  for essay_set = 4 the combined score is max(rater_domain1,rater_domain2)

In [608]:
null_counts = df_four.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_four.drop(columns_with_nulls,axis=1,inplace = True)
df_four.drop(['rater1_domain1','rater2_domain1','index'],axis = 1,inplace = True)
df_four.head(3)

   essay_set                                              essay  domain1_score
0          4  The author concludes the story with this becau...              0
1          4  The narrater has that in with Paragraph becuse...              0
2          4  The author concludes the story with that passa...              3

###  for essay_set = 5 the combined score is max(rater_domain1,rater_domain2)

In [609]:
null_counts = df_five.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_five.drop(columns_with_nulls,axis=1,inplace = True)
df_five.drop(['rater1_domain1','rater2_domain1','index'],axis = 1,inplace = True)
df_five.head(3)

   essay_set                                              essay  domain1_score
0          5  In this memoir of Narciso Rodriguez, @PERSON3'...              2
1          5  Throughout the excerpt from Home the Blueprint...              2
2          5  The mood the author created in the memoir is l...              3

###  for essay_set = 6 the combined score is max(rater_domain1,rater_domain2)

In [610]:
null_counts = df_six.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_six.drop(columns_with_nulls,axis=1,inplace = True)
df_six.drop(['rater1_domain1','rater2_domain1','index'],axis = 1,inplace = True)
df_six.head(3)

   essay_set                                              essay  domain1_score
0          6  There were many obstacles that the builders fa...              2
1          6  Him from the start, there would have been many...              3
2          6  The builders of the Empire State Building face...              4

### Here we can see domain_1 score = rater1_domain1+rater2_domain1 therefore we drop the columns

In [611]:
df_seven.isnull().sum()

index                0
essay_set            0
essay                0
rater1_domain1       0
rater2_domain1       0
rater3_domain1    1569
domain1_score        0
rater1_domain2    1569
rater2_domain2    1569
domain2_score     1569
rater1_trait1        0
rater1_trait2        0
rater1_trait3        0
rater1_trait4        0
rater1_trait5     1569
rater1_trait6     1569
rater2_trait1        0
rater2_trait2        0
rater2_trait3        0
rater2_trait4        0
rater2_trait5     1569
rater2_trait6     1569
rater3_trait1     1569
rater3_trait2     1569
rater3_trait3     1569
rater3_trait4     1569
rater3_trait5     1569
rater3_trait6     1569
dtype: int64

In [612]:
null_counts = df_seven.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_seven.drop(columns_with_nulls,axis=1,inplace = True)

df_seven.drop(['rater1_domain1','rater2_domain1','index','rater1_trait1','rater1_trait2','rater1_trait3','rater1_trait4','rater2_trait1','rater2_trait2','rater2_trait3','rater2_trait4'],axis = 1,inplace = True)
df_seven.head(3)

   essay_set                                              essay  domain1_score
0          7  Patience is when your waiting .I was patience ...             15
1          7  I am not a patience person, like I can’t sit i...             13
2          7  One day I was at basketball practice and I was...             15

### Essay 8
    For most essays:
        = (I_R1+I_R2)  +  (O_R1+O_R2)  + (S_R1+S_R2)  +  2 (C_R1+C_R2)
    When there is Rater 3 set of scores for the essay then the Total Composite Score formula changes to:
        =  2 (I_R3) + 2 (O_R3) + 2 (S_R3) + 4 (C_R3)    or equivalently   2 (I+O+S+C) +  2 (C)

In [613]:
null_counts = df_eight.isnull().sum()
columns_with_nulls = null_counts[null_counts > 1].index.tolist()
df_eight.drop(columns_with_nulls,axis=1,inplace = True)

df_eight.drop(['rater1_domain1','rater2_domain1','index','rater1_trait1','rater1_trait2','rater1_trait3','rater1_trait4','rater2_trait1','rater2_trait2','rater2_trait3','rater2_trait4','rater1_trait5','rater1_trait6','rater2_trait5','rater2_trait6'],axis = 1,inplace = True)
df_eight.head(3)

   essay_set                                              essay  domain1_score
0          8   A long time ago when I was in third grade I h...             34
1          8   Softball has to be one of the single most gre...             46
2          8   Some people like making people laugh, I love ...             40

In [614]:
final_df = df_one.append([df_two,df_three,df_four,df_five,df_six,df_seven,df_eight])

C:\Users\hs414\AppData\Local\Temp\ipykernel_3052\1613348815.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  final_df = df_one.append([df_two,df_three,df_four,df_five,df_six,df_seven,df_eight])

In [615]:
#final_df.to_csv('final_df.csv', index=False)

In [616]:
train_df = pd.read_csv('final_df.csv')

In [617]:
train_df.head(5)

   essay_set                                              essay  domain1_score
0          1  Dear local newspaper, I think effects computer...              8
1          1  Dear @CAPS1 @CAPS2, I believe that using compu...              9
2          1  Dear, @CAPS1 @CAPS2 @CAPS3 More and more peopl...              7
3          1  Dear Local Newspaper, @CAPS1 I have found that...             10
4          1  Dear @LOCATION1, I know having computers has a...              8

In [618]:
train_df['combined_score'] = train_df['domain1_score']
train_df.drop('domain1_score',axis=1,inplace=True)
train_df.head(5)

,essay_set,essay,combined_score
0,1,"Dear local newspaper, I think effects computer...",8
1,1,"Dear @CAPS1 @CAPS2, I believe that using compu...",9
2,1,"Dear, @CAPS1 @CAPS2 @CAPS3 More and more peopl...",7
3,1,"Dear Local Newspaper, @CAPS1 I have found that...",10
4,1,"Dear @LOCATION1, I know having computers has a...",8

In [619]:
train_df_copy = train_df.copy()

In [620]:
set_ranges = {
    1: (2, 12),
    2: (2, 10),
    3: (0, 3),
    4: (0, 3),
    5: (0, 4),
    6: (0, 4),
    7: (0, 30),
    8: (0, 60)
}

# Apply min-max scaling within each essay set
train_df_copy['scaled_score'] = train_df_copy.groupby('essay_set')['combined_score'].apply(
    lambda x: (x - x.min()) / (x.max() - x.min()) * (set_ranges[x.name][1] - set_ranges[x.name][0]) + set_ranges[x.name][0]
)

In [621]:
train_df_copy.head()

,essay_set,essay,combined_score,scaled_score
0,1,"Dear local newspaper, I think effects computer...",8,8.0
1,1,"Dear @CAPS1 @CAPS2, I believe that using compu...",9,9.0
2,1,"Dear, @CAPS1 @CAPS2 @CAPS3 More and more peopl...",7,7.0
3,1,"Dear Local Newspaper, @CAPS1 I have found that...",10,10.0
4,1,"Dear @LOCATION1, I know having computers has a...",8,8.0

In [622]:
train_df_copy.drop('combined_score',axis=1,inplace = True)

In [623]:
#train_df_copy.to_csv('train.csv', index=False)

In [624]:
train_df_copy.shape

(12977, 3)